// CSS 속성
// cursor: pointer; -> 마우스 커서를 올리면 마우스 모양이 손가락으로 바뀌게 해주는 속성값
//

// 부트스트랩 클래스
// table : 테이블의 기본적인 스타일 지정해주는 클래스
// text-muted : 글자 색을 약간 연하게 만들어주는 클래스
// table-bordered : 테이블의 경계선을 실선으로 만들어주는 클래스
// table-striped : 테이블 짝수 행과 홀수 행 색을 다르게 만들어주는 클래스
// table-dark : 테이블 색을 어둡게 만들어주는 클래스(다크모드)
// table-hover : <td>에 마우스를 올렸을 때 그 행의 색이 살짝 변하게 해주는 클래스
//

// thead-light : thead 부분만 밝게 바꿔주는 클래스

// container : 왼쪽 오른쪽 여백을 주는 클래스

// text-center : 텍스트를 가운데 정렬해주는 클래스.
// text-left : 텍스트를 왼쪽 정렬해주는 클래스.
// text-right : 텍스트를 오른쪽 정렬해주는 클래스.

// 1. 아코디언(accordion) 메뉴 만들기
// 아코디언 메뉴 : 접혔다 펼쳐졌다 하는 메뉴

// 부트스트랩이란?
// 부트스트랩은 트위터에서 사용하는 각종 레이아웃, 버튼, 입력창 등의 디자인을 CSS와 Javascript로 만들어 놓은 것이다.
// 웹 디자이너나 개발자 사이에서는 웹 디자인의 혁명이라고 불릴 정도로 폭발적은 반응을 얻는 프레임워크이다.

// 프레임워크와 라이브러리
// 프레임워크는 재사용이 가능한 요소들의 집합되어 있으며, 정해진 구조와 틀 안에서 이것들이 확장이 가능한 기반 코드로 이루어 짐을 뜻한다.
// jquery는 라이브러리이고, 부트스트랩은 프레임워크다.
// 따라서, 우리는 '부트스트랩 프레임워크에서 jquery 라이브러리를 사용할 수 있다.'라고 말 할 수 있다.

// 아무 의미 없는 텍스트 제공하는 사이트
// https://www.lipsum.com/

// <caption> 태그 : <table> 태그 안에 넣으면 테이블에 대한 설명을 테이블 왼쪽 아래에 추가해줌.

//

// 2. 로컬 데이터 % 로컬 스토리지
//

// 3. 테이블 및 쿠키 활용
//

// 4. 쿠키 라이브러리
//

// 5. 가상요소 디자인 및 팝업창
//
