// - Mesh Network(그물 망)
// 차세대 이동통신, 홈네트워킹, 공공 안전 등 특수 목적을 위한 새로운 방식의 네트워크 기술로 대규모 디바이스 네트워크 생성에 최적화된 기술.
// Mesh Network는 그물망이라는 의미로, 네트워크 장치가 각각 그물망처럼 연결되어 하나의 큰 네트워크를 이루는 것을 의미한다.
// 각 기본 기지국을 전체 망에 위치한 인접 노드 모두와 네트워크 상태에 대한 정보를 계속 교환하는 하나의 노드로 처리한다.
// 이런 방식은 데이터를 교환하지 않는 노드들도 다른 노드에 대한 정보를 인지하도록 만들게 되며,
// 현재 상용화된 시스템들은 간섭을 최소화하고, 가능한 한 가장 넓은 범위를 제공하기 위해 동적으로 무선 속성과 채널을 조정함으로써 아주 높은 처리량을 구현한다.
// 기존의 무선 LAN의 한계를 극복하여 이동통신사들이 구축한 무선 WI-FI 존을 공원이나 리조트 항만 등 넓은 범위로 구축 및 확장이 가능하다.
// 특히 안정성, 확장성, 보안성까지 갖추고 있어서 건물 자동화, 센서네트워크, 사물인터넷(IoT) 기술력의 솔루션에도 적합하다.

// - Wifi
// - Backhaul(백홀) || Backhaul Network(백홀망)
// 네트워크의 백홀(backhaul)은 계층적 통신 네트워크에서 코어 네트워크(백본망)과 네트워크 에지(edge) 부분의 작은 부분망들 사이의 중간 링크를 구성한다.
// 이러한 망과 관련하여 백홀은 패킷을 백본망으로부터 가져오거나 백본망에 전달하는 의무를 지닌다.
// 유선또는 무선에 흐르는 데이터를 한곳에 모아서 백본망에 전달해주는것을 말한다.
// 음성 또는 데이터를 기지국에서 모아서 해당 통신사업자의 백본망에 전달해주는 것을 "백홀", 해당 역할을 하는것을 "백홀 장비", 그전체 환경을 "백홀망".
// - Backbone(백본) || Backbone Network(백본망) || Core Network(중추망)
// 다양한 네트워크를 상호 연결하는 컴퓨터 네트워크의 일부로서, 각기 다른 LAN이나 부분망 간에 정보를 교환하기 위한 경로를 제공한다.
// 백본은 같은 건물 안에, 다른 건물 안에, 또 캠퍼스 환경 안에, 아니면 넓은 지역에 걸쳐 다양한 네트워크를 묶을 수 있다.
// 일반적으로 백본의 용적은 그와 연결된 네트워크보다 더 크다

// - Mesh Network 구성 요소
// 1) 엔드포인트(End Points)
// 엔드포인트는 데이터를 리피터로 보내거나 리피터로부터 데이터를 수신하는 역할을 한다.
// 메시 네트워크의 다른 장치들 간의 메시지 전송에 관여하지 않는다.
// 일반적으로 디바이스와 센서가 대표적인 엔드포인트의 역할을 한다.
// 2) 리피터(Repeater)
// 리피터는 여러 엔드포인트나 리피터, 게이트웨이와 동적으로 통신한다.
// 센서나 액츄에이터가 장착된 경우에는 엔드포인트의 역할도 수행한다.
// 기본적으로 리피터는 메시 네트워크를 통해 데이터를 효율적으로 이동시키는 역할을 수행한다.
// 3) 게이트웨이(Gateway)
// 게이트웨이는 인터넷의 메시 네트워크와 외부 네트워크 사이의 백홀(Backhaul) 역할을 한다.
// 게이트웨이는 Wifi 또는 셀룰러 데이터 표준을 포함한 다양한 커뮤니케이션 기술을 사용할 수있다.

// - Mesh Network 장점
// 1) 경로에 대한 자동 구성 능력
// 2) 자가 치유 능력이 있어 안전하다(연결된 통신이 끊기면 최적의 트래픽 경로를 재산정해 새롭게 구성해줌).
// 3) 일부 노드의 경우 무선만으로도 통신이 가능하다.
// 4) 동적 라우팅과 복수 개의 경로 사용을 통한 로드 밸런싱이 이루어져 트래픽을 분산시킨다.
// 5) 넓은 공간에 안정적으로 사용이 가능하다.
// 6) 장비를 손쉽게 추가할 수 있어 유용성과 확장성이 좋다.
// 7) 경제적이다(추가적인 케이블 설치없이 네트워크 확장과 수정이 가능함).

// - Mesh Network 단점
// 1) 메시 네트워크 구축시 모두 같은 브랜드 제품으로 통일해야 하는 번거로움이 있다.
// 2) 국제표준이 애매하다.
// 3) 브랜드별 독자적인 기술이 적용되어 비교분석이 필수적이다.

//
