// - 운영체제(Operating System, OS)
// 사용자의 하드웨어, 시스템 리소스를 제어하고 프로그램에 대한 일반적 서비스를 지원하는 시스템 소프트웨어이다.

// - 유휴시간 : 컴퓨터가 작동 가능한데도 작업을 하지 아니하는 시간.
// - 주기억장치(or 컴퓨터 메모리(computer memory)) : 컴퓨터에서 수치·명령·자료 등을 기억하는 컴퓨터 하드웨어 장치를 가리킨다.

// - 운영체제의 종류
// 1) 일괄처리 시스템(Batch Processing System)
// 일괄 처리 시스템은 초기의 컴퓨터 시스템에서 사용된 형태로, 일정량 또는 일정 기간 동안 데이터를 모아서 한꺼번에 처리하는 방식이다.
// 일괄 처리를 위해 적절한 작업 제어 언어(Job Control Language)를 제공해야 한다.
// 컴퓨터 시스템을 효율적으로 사용할 수 있다.
// 반환시간(Turn Around Time)이 늦지만 하나의 작업이 모든 자원을 독점하므로 CPU 유휴시간이 줄어든다.
// 급여 계산, 지불 계산, 연말 결산 등의 업무에 주로 사용된다.
// 2) 다중 프로그래밍 시스템(Multi-Programming System)
// 다중 프로그래밍 시스템은 하나의 CPU와 주기억장치를 이용하여 여러 개의 프로그램을 동시에 처리하는 방식이다.
// 하나의 주기억장치에 두 개 이상의 프로그램을 기억시켜 놓고, 하나의 CPU와 대화하면서 동시에 처리한다.
// CPU 사용률과 처리량이 증가한다.
// 3) 시분할 시스템(Time Sharing System)
// 시분할 시스템은 여러 명의 사용자가 사용하는 시스템에서 컴퓨터가 사용자들의 프로그램을 번갈아가며 처리해줌으로써
// 각 사용자에게 독립된 컴퓨터를 사용하는 느낌을 주는 것으로, 라운드 로빈(Round Robin) 방식이라고도 한다.
// 여러 사용자가 각자의 단말 장치를 통하여 동시에 운영체제와 대화하면서 각자의 프로그램을 실행한다.
// 하나의 CPU는 같은 시점에서 여러 개의 작업을 동시에 수행할 수 없기 때문에,
// CPU 전체 사용시간을 작은 작업 시간량으로 쪼개어 그 시간량 동안만 번갈아가면서 CPU를 할당하여 각 작업을 처리한다.
// 다중 프로그래밍 방식과 결합하여 모든 작업이 동시에 진행되는 것처럼 대화식 처리가 가능하다.
// 시스템의 전체 효율은 좋아지나 개인별 사용자 입장에서는 반응속도가 느려질 수 있다.
// 각 작업에 대한 응답시간을 최소한으로 줄이는 것을 목적으로 하며, 하드웨어를 보다 능률적으로 사용할 수 있다.
// 4) 다중처리 시스템(Multi-Processing System)
// 다중처리 시스템은 여러 개의 CPU와 하나의 주기억장치를 이용하여 여러 개의 프로그램을 동시에 처리하는 방식이다.
// 하나의 CPU가 고장나더라도 다른 CPU를 이용하여 업무를 처리할 수 있으므로 시스템의 신뢰성과 안정성이 높다.
// 여러 CPU는 하나의 메모리를 공유하며 단일 운영체제에 의해 관리된다.
// 프로그램의 처리 속도는 빠르지만, 기억장치, 입출력장치 등의 자원 공유에 대한 문제점을 해결해야 한다.
// 5) 실시간 처리 시스템(Real Time Processing System)
// 실시간 처리 시스템은 데이터 발생 즉시, 또는 데이터 처리 요구가 있는 즉시 처리하여 결과를 산출하는 방식이다.
// 처리시간이 단축되고 처리비용이 절감된다.
// 우주선 운행, 교통 제어, 레이더 추적기, 핵물리학 실험 및 데이터 수집, 전화교란장치의 제어, 은행의 온라인 업무 등
// 시간에 제한을 두고 수행되어야 하는 작업에 주로 사용된다.
// 6) 다중 모드 처리(Multi Mode Processing)
// 다중 모드 처리는 일괄 처리 시스템, 시분할 시스템, 다중 처리 시스템, 실시간 처리 시스템을 한 시스템에서 모두 제공하는 방식이다.
// 7) 분산 처리 시스템(Distributed Processing System)
// 분산 처리 시스템은 여러 개의 컴퓨터(프로세서)를 통신 회선으로 연결하여 하나의 작업을 처리하는 방식이다.
// 각 단말장치나 컴퓨터 시스템은 고유의 운영체제와 CPU, 메모리를 가지고 있다.

// - 시분할 시스템의 목적
// 여러 프로그램이 동시에 돌아가는 착각을 할 수 있도록 라운드 로빈 스케줄링 방식을 사용하는 것
