// - 미들웨어(Middleware)
// 클라이언트와 서버 간의 통신을 담당하는 시스템 소프트웨어이다.
// 공통 서비스 및 기능을 애플리케이션에 제공하여 개발자와 운영자가 애플리케이션을 더욱 효율적으로 구축하고 배포하도록 돕는 소프트웨어 및 클라우드 서비스이다.
// 이기종 하드웨어, 소프트웨어, 네트워크, 프로토콜, PC환경, 운영체제 환경 등에서 시스템 간의 표준화된 연결을 도와주는 소프트웨어이다.
// 표준화된 인터페이스를 통하여 시스템 간의 데이터 교환에 있어 일관성을 제공한다.
// 애플리케이션과 운영체제 사이에서 중간 매개 역할을 하는 다목적 소프트웨어이다.
// 미들웨어의 서비스 이용을 위해 사용자가 정보 교환 방법 등의 내부 동작을 알 필요가 없다.

// - 이기종 컴퓨팅 : 하나 이상의 프로세서 또는 코어를 사용하는 시스템.

// - MOM(Message-Oriented Middleware) 설명
// 메시지 기반의 비동기형 메시지를 전달하는 방식의 미들웨어이다.
// 온라인 업무보다는 이기종 분산 데이터 시스템의 데이터 동기를 위해 많이 사용한다.
// MOM은 즉각적인 응답을 원하는 경우가 아니라 다소 느리고 안정적인 응답을 필요로 하는 경우에 많이 사용한다.
// 독립적인 애플리케이션을 하나의 통합된 시스템으로 묶기 위한 역할을 한다.
// 송신측과 수신측의 연결 시 메시지 큐를 활용하는 방법이 있다.
// 상이한 애프리케이션 간 통신을 비동기 방식으로 지원한다.
