// - UML 다이어그램 (Unified Modeling Language Diagram)

// - UML 다이어그램 설명
// 통합 모델링 언어를 사용하여 시스템 상호작용, 업무 흐름, 시스템 구조, 컴포넌스 관계 등을 그린 도면이다.
// 프로그래밍을 단순화시켜 표현하며 의사소통하기 좋고 또 대규모 프로젝트 구조의 로드맵을 만들거나 개발을 위한 시스템 구축에 기본을 마련한다.

// - UML 다이어그램 분류
// 정적구조 : 클래스, 객체, 패키지, 컴포넌트, 복합구조, 배치
// 동적구조 : 유스케이스, 상태, 활동, 시퀀스, 통신, 상호작용, 타이밍

// - UML 다이어그램 종류
// 1) 클래스 다이어그램
// 객체를 생성하기 위한 도구
// 2) 객체 다이어그램
// 객체 간의 연결관계를 표현
// 3) 패키지 다이어그램
// 객체들의 그룹화된 표현
// 4) 컴포넌트 다이어그램
// 시스템을 구성하는 컴포넌트 사이에 의존관계를 표현
// 5) 복합구조 다이어그램
// 컴포넌트나 클래스의 내부 구조를 보여주기 위해 사용(내부 연결 형태를 표현)
// 6) 배치 다이어그램
// H/W 자원에 연결된 S/W 컴포넌트 배치를 표현
// 7) 유스케이스 다이어그램
// 사용자의 시각에서 소프트웨어의 범위와 기능을 표현
// 8) 상태 다이어그램
// 시간에 따라 객체가 변하는 상태를 표현
// 9) 활동 다이어그램
// 객체의 동적 행위를 활동으로 표현
// 10) 시퀀스 다이어그램
// 객체간 상호작용을 시간 순서에 따른 메시지로 표현
// 11) 통신 다이어그램
// 갹채간 상호작용을 관계 형태의 메시지로 표현
// 12) 상호작용 다이어그램
// 객체들의 상호작용 관계를 표현
// 13) 타이밍 다이어그램
// 객체간 상태변화를 구체적인 시간으로 표현
